import React from "react";
import * as S from "./styles";

const DescriptionProfile = () => {
  return (
    <S.Description>
      <S.DescriptionText>
        Профіль це особиста сторінка, де ви можете представити себе та
        поділитися важливою інформацією про себе з іншими. Незалежно від того,
        чи ви використовуєте профіль у соціальній мережі, професійній платформі
        або будь-якому іншому сервісі, короткий опис вашого профілю - це ваша
        можливість викласти найважливіші аспекти вашої особистості.
        Використовуйте цей коротенький опис, щоб залучити увагу, показати свої
        зацікавлення та цілі, та надати чітку уяву про те, хто ви є. Залежно від
        вашого контексту, наведу приклад:
      </S.DescriptionText>
      <S.DescriptionText>
        "Привіт! Я студент з великим захопленням науковими дослідженнями та
        технологіями. Я вивчаю комп'ютерні науки та працюю над власними
        проектами штучного інтелекту. Відкритий до нових викликів та постійно
        вдосконалюю свої навички. Я також люблю подорожувати та вивчати нові
        культури. Радий спілкуватися та співпрацювати з однодумцями.
        Приєднуйтесь до мене, щоб дізнатися більше!"
      </S.DescriptionText>
    </S.Description>
  );
};

export default DescriptionProfile;
